{
    "name": "Smelting Metals II",
    "icon": "factoryautomation:ingot_tin",
    "category": "factoryautomation:age1",
    "sortnum": 3,
    "pages": [
        {
            "type": "text",
            "text": "I know that you finally want to have your ingots, but theres more to do until you can get some. To use the foundry, you will need coal or charcoal to heat it up. Once you have done that, you will need something to cast in. That \"something\" is green sand.",
        	"title": "Foundry Chapter II"
        },
		{
            "type": "crafting",
        	"recipe": "factoryautomation:crafting_recipes/green_sand",
            "text": "To craft green sand, you will need some clay balls and sand. After you have the green sand, right click with it on the casting vessel. This should place the green sand in the casting vessel. After that's done, get yourself a regular stick, and right click with it on the vessel to open the menu where you can select what pattern should be casted.",
        	"title": "Stone Crucible"
        },
		{
            "type": "image",
			"images": ["factoryautomation:textures/patchouli/gui_stone_casting_vessel.png"],
			"title": "Vessel GUI"
        },
		{
            "type": "text",
            "text": "Here you can select what you want to cast. Now you can put your ore chunks into the foundry, and after they melt you can cast them into the vessel. But be careful, dont touch the hot parts immediately because they WILL burn you. After they are cool enough, you can grab them.",
            "title": "How to Use It"
        },
		{
            "type": "text",
            "text": "The major issue with this machine is, if you don't cast the the right amount eg. don't have enough molten metal in it and start casting into shapes, the material simply will be wasted. So here's a quick tip: one chunk of ore gives 1 ingot of molten metal; An ingot obviously costs one ingot; A plate costs 2 ingots; A gear costs 6 ingots; A rod costs 1 ingot; A coin also costs 1 ingot.",
            "title": "The Drawbacks"
        }
    ]
}